app/views/books/show.html.erb

                             <p>
                                 <%= link_to book_favorite_path(@book, Favorite.find_by(book_id: @book.id)), method: :delete, class: "text-danger" do %>
                                     <i class="fas fa-heart"></i>
                                     <%= @book.favorites.count %>
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."book_id" = ? LIMIT ?  [["book_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

                                     <i class="fas fa-heart"></i>
                                         <%= @book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]