app/controllers/users_controller.rb

  def index
    @users = User.page(params[:page]).reverse_order
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

  def update
    user = User.find(params[:id])
    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "g48tyr6bh"], ["introduction", "yv8ty8nrpakmv29xm84"], ["updated_at", "2021-05-04 17:39:09.102674"], ["id", 2]]