app/models/user.rb

  def follow(user_id)
    relationships.create(followed_id: user_id)
---
INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 2], ["followed_id", 1], ["created_at", "2021-05-07 14:52:42.844606"], ["updated_at", "2021-05-07 14:52:42.844606"]]